# RoomTagType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RoomTag..::..RoomTagType Property
RoomTag Class See Also
---
The tag type.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public RoomTagType RoomTagType { get; set; }
```

Visual Basic
---
```text
Public Property RoomTagType As RoomTagType
	Get
	Set
```

Visual C++
---
```text
public:
property RoomTagType^ RoomTagType {
	RoomTagType^ get ();
	void set (RoomTagType^ value);
}
```

# See Also
RoomTag Class
Autodesk.Revit.DB.Architecture Namespace